backend/controllers/AdminController.php

SELECT * FROM `user` WHERE `id`='1'
---
    public function actionChangepassword() {
        $model = new PasswordForm();
        if ($model->load(Yii::$app->request->post())) {
            if ($user = $model->change()) {
                Yii::$app->getSession()->setFlash('success', \Yii::t('app', 'You have successfully updated!'));
                return $this->redirect(['changepassword']);
            }
        }
        $user = $this->findModel(\Yii::$app->user->id);