common/models/searchs/AuthItem.php

SELECT * FROM `auth_item` WHERE `type`=2
---
    public function search($params) {
        /* @var \yii\rbac\Manager $authManager */
        $authManager = Yii::$app->getAuthManager();
        if ($this->type == Item::TYPE_ROLE) {
            $items = $authManager->getRoles();
        } else {
//            if (\Yii::$app->user->identity->role == 'admin') {
//                $items = array_filter($authManager->getPermissions(), function($item) {
//                    return $this->type == Item::TYPE_PERMISSION xor strncmp($item->name, '/', 1) === 0;
//                });
//            } else {
            $items = array_filter($authManager->getPermissions(), function($item) {
                return $this->type == Item::TYPE_PERMISSION xor strncmp($item->name, '/', 1) === 0;
            });
//            }
        }
        $this->load($params);